"3-finger Horizontal Swipe" = "3 barmoqli gorizontal surish";
"3-finger Vertical Swipe" = "3 barmoqli vertikal surish";
"4-finger Horizontal Swipe" = "4 barmoqli gorizontal surish";
"4-finger Vertical Swipe" = "4 barmoqli vertikal surish";
"About" = "Haqida";
"About %@" = "%% @";
"Accessibility" = "Erkinlik";
"Acknowledgments" = "Minnatdorchilik";
"Active app" = "Faol ilova";
"Active screen" = "Faol ekran";
"Active Space" = "Faol bo'sh joy";
"Add a running app" = "Ishlayotgan ilovani qo'shish";
"Add an app from disk" = "Diskdan ilova qo'shish";
"Additional controls" = "Qo'shimcha boshqarish vositalari";
"Additional controls…" = "Qo'shimcha boshqarish vositalari ...";
"Advanced" = "Rivojlangan";
"After keys are released" = "Tugmalar qo'yib yuborilgandan so'ng";
"After release" = "Ozod qilingandan keyin";
"Align windows" = "Derazalarni tekislang";
"Align windows:" = "Oynalarni tekislash:";
"All apps" = "Barcha ilovalar";
"All data from this form will be made public, as a ticket on github.com" = "Ushbu shakldagi barcha ma'lumotlar Gitbub.com-da chipta sifatida ommaga taqdim etiladi";
"All screens" = "Barcha ekranlar";
"All Spaces" = "Barcha bo'shliqlar";
"Allowed" = "Ruxsat berilgan";
"Alphabetical" = "Alifbo tartibida";
"Alphabetical Order" = "Alifbo tartibida";
"Also select windows using:" = "Oynalarni shuningdek quyidagilar yordamida tanlash:";
"AltTab crashed last time you used it. Sending a crash report will help get the issue fixed" = "Altabab oxirgi marta siz undan foydalanganingizda qulab tushdi.Avariya hisobotini yuborish muammoni hal qilishga yordam beradi";
"AltTab is currently set to show Applications. This setting is only available when AltTab is set to show Windows." = "Hozirda Altabtob dasturlarni namoyish etish uchun o'rnatiladi.Ushbu sozlama faqat AltTab derazalarni ko'rsatish uchun mavjud bo'lganda mavjud.";
"AltTab is running without Screen Recording permissions. Thumbnails won’t show." = "AltTab ekran yozish ruxsatlarisiz ishlayapti. Eskizlar ko'rsatilmaydi.";
"AltTab needs some permissions" = "Olttab ba'zi ruxsatlarga muhtoj";
"AltTab will show if the window is currently minimized or fullscreen with a status icon." = "Altabab oynaning status belgisi bilan minimallashtirilgan yoki to'liq ekranli bo'lsa, ko'rsatadi.";
"Always" = "Har doim";
"Always send crash reports" = "Har doim avtohalokat haqida xabarlarni yuboring";
"and press" = "va bosing";
"and press:" = "va bosing:";
"Animations" = "Animatsiyalar";
"Animations…" = "Animatsiyalar ...";
"App (BundleID starting with)" = "Ilova (Bmadleiddan boshlab)";
"App Icons" = "Ilova piktogrammasi";
"App is hidden" = "Ilova yashirin";
"App is running but has no open window" = "Ilova ishlamoqda, ammo ochiq deraza yo'q";
"Apparition delay" = "Ko'rish kechikishi";
"Apparition delay of Switcher" = "O'zgartirgichning paydo bo'lish kechikishi";
"Apparition delay:" = "Paydo bo'lish kechikishi:";
"Appearance" = "Ko`rinish";
"Application Name" = "Ilova nomi";
"Application Name - Window Title" = "Ilova nomi - oyna nomi";
"Applications" = "Arizalar";
"Are you sure you don’t want a response?" = "Haqiqatan ham javob berishni xohlamaysizmi?";
"Arrow keys" = "O'q tugmachalari";
"Ask whether to send crash reports" = "Avtohalokat haqida xabar berishni so'rang";
"Auto" = "Avto";
"Auto-install updates periodically" = "Vaqti-vaqti bilan yangilanishlarni avtomatik o'rnatish";
"Blacklists" = "Qora ro'yxatga olinganlar";
"Cancel" = "Bekor";
"Cancel and hide" = "Bekor qilish va yashirish";
"Capture windows in the background" = "Oynalarni fonda suratga olish";
"Center" = "Markaz";
"Check for updates now…" = "Yangilanishlarni hozir tekshiring…";
"Check for updates periodically" = "Vaqti-vaqti bilan yangilanishlarni tekshirish";
"Check for updates…" = "yangilanishlarni tekshir";
"Check permissions…" = "Ruxsatnomalarni tekshirish ...";
"Close window" = "Oynani yopish";
"Conflicting shortcut" = "Qarama-qarshi yorliq";
"Controls" = "Boshqaruv";
"Crash reports policy" = "Avariya hisobotlari siyosati";
"Crash reports policy:" = "Halokat hisobotlari siyosati:";
"Cursor follows focus" = "Kursor fokusga ergashadi";
"Customize App Icons style…" = "Ilova ikonkalari uslubini sozlash ...";
"Customize Thumbnails style…" = "Thumbnails uslubini sozlash ...";
"Customize Titles style…" = "Titmalar uslubini sozlash ...";
"Dark" = "Qorong'i";
"Debug tools" = "Disk raskadrovka vositalari";
"Disabled" = "O'chirilgan";
"Do nothing" = "Hech narsa qilmang";
"Don’t check for updates periodically" = "Vaqti-vaqti bilan yangilanishlarni tekshirishma";
"Don’t send" = "Yubormang";
"Don’t show windows from these apps" = "Ushbu ilovalardan oynalarni ko'rsatmaslik";
"Done" = "Bajarildi";
"End" = "Oxiri";
"Exceptions" = "Istisnolar";
"Export settings…" = "Sozlamalarni eksport qilish…";
"Export…" = "Eksport…";
"Fade in animation of Preview" = "Oldindan ko'rishning paydo bo'lish animatsiyasi";
"Fade out animation" = "Yo'q animatsiya";
"Fade out animation of Switcher" = "O'zgartirgichning sarg'ayish animatsiyasi";
"Fade out animation:" = "Sarg'ayish animatsiyasi:";
"Failed to import settings" = "Sozlamalarni import qilish muvaffaqiyatsiz tugadi";
"Focus selected window" = "Face Tanlangan oynani";
"Fullscreen window" = "To'liq ekranli oyna";
"Fullscreen windows:" = "To'liq ekranli oynalar:";
"Fullscreen/Defullscreen window" = "To'liq ekranli / ximuls ekran oynasi";
"General" = "Umumiy";
"Gesture" = "Ishora";
"Grant permission" = "Ruxsat berish";
"Hidden windows:" = "Yashirin oynalar:";
"Hide" = "Yashirmoq";
"Hide app badges" = "Ilova nishonlarini yashirish";
"Hide app badges:" = "Ilova nishonlarini yashirish:";
"Hide apps with no open window" = "Ilovalarni ochiq oyna bilan yashiring";
"Hide apps with no open window:" = "Ochiq oynasi bo'lmagan ilovalarni yashirish:";
"Hide colored circles on mouse hover" = "Sichqonchani sichqonchada yashiring";
"Hide colored circles on mouse hover:" = "Sichqoncha ustida ushlab turilganda rangli doiralarni yashirish:";
"Hide in %@" = "% @";
"Hide Space number labels" = "Bo'shliq raqami teglarini yashirish";
"Hide Space number labels:" = "Bo'shliq raqami teglarini yashirish:";
"Hide status icons" = "Holat belgilarini yashirish";
"Hide status icons:" = "Holat belgilarini yashirish:";
"Hide window thumbnails:" = "Oyna eskizlarini yashirish:";
"Hide/Show app" = "Ilovani yashirish / ko'rsatish";
"High" = "Baland";
"Highest" = "Eng yuqori";
"Hold" = "Ushlab turmoq";
"Horizontal Swipe with Four Fingers" = "To'rt barmoq bilan gorizontal surish";
"Horizontal Swipe with Three Fingers" = "Uch barmoq bilan gorizontal surish";
"I think the app could be improved with…" = "Menimcha, ilova yaxshilanishi mumkin ...";
"Ignore shortcuts when active" = "Faol bo'lganda yorliqlarni e'tiborsiz qoldiring";
"Ignore shortcuts while a window from these apps is active" = "Ushbu ilovalardan oyna faol bo'lsa, yorliqlarni e'tiborsiz qoldirish";
"Import settings…" = "Sozlamalarni import qilish…";
"Import…" = "Import…";
"Keep open" = "Ochiq qoldirish";
"Keep open and search" = "Ochiq qoldirish va qidirish";
"Language" = "Til";
"Language Change" = "Tilni o'zgartirish";
"Large" = "Katta";
"Later" = "Keyinroq";
"Latest releases" = "So'nggi relizlar";
"Leading" = "Yetakchi";
"Left" = "Chap";
"Light" = "Yorug'lik";
"Lock search" = "Qidiruvni qulflash";
"Max height on screen:" = "Ekranda maksimal balandlik:";
"Max width on screen:" = "Ekranda maksimal kenglik:";
"Medium" = "O'rta";
"Menubar icon" = "Menubar ikonkasi";
"Menubar icon:" = "Menyu paneli belgisi:";
"Middle" = "O'rtada";
"Minimize/Deminimize window" = "Oynani minimallashtirish / o'chirish";
"Minimized windows:" = "Kichraytirilgan oynalar:";
"Miscellaneous" = "Turli xil";
"Miscellaneous:" = "Turli xil:";
"Mouse hover" = "Sichqoncha ustida ushlab turish";
"Multiple screens" = "Bir nechta ekranlar";
"Never" = "Hech qachon";
"Never send crash reports" = "Hech qachon avtohalokat haqida xabar yubormang";
"No Window" = "Oyna yo'q";
"Non-active apps" = "Faol bo'lmagan ilovalar";
"Non-visible Spaces" = "Ko'rinmaydigan bo'shliqlar";
"Normal" = "Normal";
"Not allowed" = "Ruxsat berilmagan";
"NSHumanReadableCopyright" = "GPL-3.0 litsenziyasi";
"Only if the window is fullscreen" = "Faqat oyna to'liq ekranli bo'lsa";
"Only on different screen" = "Faqat boshqa ekranda";
"Open Accessibility Preferences…" = "Ochiq foydalanish imtiyozlari ...";
"Open Accessibility Settings…" = "Maxsus imkoniyatlar sozlamalarini ochish…";
"Open Screen Recording Preferences…" = "Ekran yozuvini qayd etish imtiyozlari ...";
"Open Screen Recording Settings…" = "Ekran yozib olish sozlamalarini ochish…";
"Open System Settings to confirm, and continue" = "Tasdiqlash va davom etish uchun tizim sozlamalarini oching";
"Open Trackpad Preferences…" = "Trekpad sozlamalarini ochish…";
"Open Trackpad Settings…" = "Trekpad sozlamalarini ochish…";
"Optional: email (if you want a reply)" = "Ixtiyoriy: Elektron pochta (agar javobni xohlasangiz)";
"Order windows by" = "Windows-ni buyurtma qiling";
"Please fill in the form" = "Iltimos, shaklni to'ldiring";
"Policies" = "Siyosat";
"Preferences…" = "Afzalliklar ...";
"Preview selected window" = "Tanlangan oynani ko'rib chiqish";
"Preview selected window:" = "Tanlangan oynani oldindan ko'rish:";
"Preview the selected window." = "Tanlangan oynani oldindan ko'rib chiqing.";
"Quit" = "Ketmoq";
"Quit %@" = "% @";
"Quit app" = "Chiqish ilovasi";
"Recently Created" = "Yaqinda yaratilgan";
"Recently Created First" = "Yaqinda birinchi bo'lib yaratilgan";
"Recently Focused" = "Yaqinda fokuslangan";
"Recently Focused First" = "Yaqinda birinchisi";
"Remember my choice" = "Mening tanlovimni eslang";
"Reset preferences and restart" = "Afzalliklar va qayta ishga tushirish";
"Reset preferences and restart…" = "Afzalliklar va qayta ishga tushirish ...";
"Reset settings and restart" = "Sozlamalarni tiklash va qayta ishga tushirish";
"Reset settings and restart…" = "Sozlamalarni tiklash va qayta ishga tushirish…";
"Restart Now" = "Hozir qayta ishga tushirish";
"Rows of thumbnails:" = "Eskizlar qatorlari:";
"Screen including menu bar" = "Ekran menyu satr";
"Screen including mouse" = "Sichqoncha ekranini o'z ichiga oladi";
"Screen Recording" = "Ekran yozuvi";
"Screen showing AltTab" = "Olttab ko'rsatadigan ekran";
"Search" = "Qidiruv";
"Select next window" = "Keyingi oynani tanlang";
"Select previous window" = "Oldingi oynani tanlang";
"Select windows on mouse hover" = "Sichqonchani sichqonchani tanlang";
"Select windows using arrow keys" = "O'q tugmalaridan foydalangan holda Windows-ni tanlang";
"Select windows using vim keys" = "Vim tugmachalari yordamida Windows-ni tanlang";
"Send" = "Yuborish";
"Send a crash report?" = "Avariya hisobotini yuboring?";
"Send anyway" = "Baribir yuboring";
"Send debug profile (CPU, memory, etc)" = "Narxie Profilini yuboring (protsessor, xotira va hk)";
"Send feedback" = "Fikr-mulohazalarni yuboring";
"Send feedback…" = "Fikr-mulohazalar yuborish ...";
"Settings imported" = "Sozlamalar import qilindi";
"Settings…" = "Sozlamalar";
"Share improvement ideas, or report bugs" = "Mamlakatni obodonlashtirish g'oyalarini yoki xatolarni xabar qiling";
"Shortcut" = "Yorliq";
"Shortcut 1" = "Yorliq 1";
"Shortcut 2" = "Yorliq 2";
"Shortcut 3" = "Yorliq 3";
"Shortcut 4" = "Yorliq 4";
"Shortcut 5" = "Yorliq 5";
"Shortcut already assigned to another action: %@" = "QisqaCUT allaqachon boshqa harakatga tayinlangan:% @";
"Shortcuts When Active" = "Faol bo'lganda yorliqlar";
"Shortcuts when active…" = "Faol bo'lganda yorliqlar ...";
"Show" = "Ko'rsatish";
"Show & Hide" = "Ko'rsatish va yashirish";
"Show an item in the switcher for each window, or for each application. Windows will be focused, whereas applications will be activated." = "Har bir deraza uchun yoki har bir dastur uchun elementni ko'rsating.Windows yo'naltiriladi, ilovalar faollashtiriladi.";
"Show apps with no open window" = "Ochiq oynasi bo'lmagan ilovalarni ko'rsatish";
"Show at the end" = "Oxirida ko'rsatish";
"Show fullscreen windows" = "To'liq ekranli derazalarni ko'rsating";
"Show hidden windows" = "Yashirin derazalar ko'rsating";
"Show in switcher" = "Usta-da ko'rsating";
"Show minimized windows" = "Minimallashtirilgan derazalarni ko'rsatish";
"Show on" = "Ko'rsatmoq";
"Show on:" = "Ko'rsatish joyi:";
"Show standard tabs as windows" = "Windows sifatida standart yorliqlarni ko'rsating";
"Show standard tabs as windows:" = "Standart varaqalarni oyna sifatida ko'rsatish:";
"Show titles" = "Sarliqlarni ko'rsating";
"Show windows from applications" = "Ilovalardan derazalarni ko'rsatish";
"Show windows from screens" = "Derazalarni ekranlardan ko'rsating";
"Show windows from Spaces" = "Derazalarni bo'sh joylardan ko'rsatish";
"Show windows from:" = "Oynalarni ko'rsatish joyi:";
"Size" = "O'lcham";
"Skipped" = "O'tkazib yuborildi";
"Small" = "Kichik";
"Some apps like Finder or Preview use standard tabs which act like independent windows. Some other apps like web browsers use custom tabs which act in unique ways and are not actual windows. AltTab can't list those separately." = "Finder yoki oldindan ko'rish kabi ba'zi ilovalar mustaqil Windows kabi ishlaydigan oddiy yorliqlardan foydalaning.Veb-brauzerlar kabi ba'zi boshqa ilovalar noyob yo'llar bilan shug'ullanadigan va haqiqiy derazalar emas.Altabab alohidalarni ro'yxatga olish mumkin emas.";
"Source code repository" = "Manba kodi ombori";
"Space" = "Bo'sh joy";
"Space Order" = "Kosmik buyurtma";
"Start" = "Boshlamoq";
"Start at login" = "Kirishdan boshlang";
"Start at login:" = "Kirishda ishga tushirish:";
"Support this project" = "Ushbu loyihani qo'llab-quvvatlang";
"Swipe with Four Fingers" = "To'rt barmoq bilan surish";
"Swipe with Three Fingers" = "Uch barmoq bilan surish";
"Switch between 3 different styles. You can customize them." = "3 xil uslubni almashtiring.Siz ularni sozlashingiz mumkin.";
"System" = "Tizim";
"System Default" = "Tizim standarti";
"The ⌘⎋ (command+escape) shortcut may be used by macOS for GameOverlay.\n\nYour change would assign it to: %@.\n\nIf you want to continue, make sure that the GameOverlay shortcut is disabled.\nAlso note that macOS has reported bugs where the shortcut may still interfere while disabled." = "⌘⎋ (command+escape) yorlig'i macOS tomonidan GameOverlay uchun ishlatilishi mumkin.\n\nSizning o'zgarishingiz uni: %@ ga tayinlaydi.\n\nAgar davom etmoqchi bo'lsangiz, GameOverlay yorlig'i o'chirilganligiga ishonch hosil qiling.\nShuni ham yodda tutingki, macOS yorliq o'chirilgan bo'lsa ham aralashuvga olib kelishi mumkin bo'lgan xatolar haqida xabar bergan.";
"The ⎋ (escape) key is reserved by some macOS shortcuts (e.g. ⌘⌥⎋ will show the Force Quit Applications window).\n\nIf you want to use ⎋, make sure that Hold modifiers are neither: ⌘⌥, ⌘⌥⇧, or ⌘⌥⇧⌃" = "⎋ (escape) tugmasi ba'zi macOS yorliqlari tomonidan band qilingan (masalan, ⌘⌥⎋ Force Quit Applications oynasini ko'rsatadi).\n\nAgar siz ⎋ tugmasidan foydalanmoqchi bo'lsangiz, Hold modifikatorlari ⌘⌥, ⌘⌥⇧ yoki ⌘⌥⇧⌃ emasligiga ishonch hosil qiling";
"The ⎋ (escape) key is reserved by some macOS shortcuts (e.g. ⌘⌥⎋ will show the Force Quit Applications window).\n\nYour change would assign it to: %@.\n\nIf you want to use ⎋, make sure that Hold modifiers are neither: ⌘⌥, ⌘⌥⇧, or ⌘⌥⇧⌃" = "⎋ (escape) tugmasi ba'zi macOS yorliqlari tomonidan band qilingan (masalan, ⌘⌥⎋ Force Quit Applications oynasini ko'rsatadi).\n\nSizning o'zgarishingiz uni: %@ ga tayinlaydi.\n\nAgar siz ⎋ tugmasidan foydalanmoqchi bo'lsangiz, Hold modifikatorlari ⌘⌥, ⌘⌥⇧ yoki ⌘⌥⇧⌃ emasligiga ishonch hosil qiling";
"The application needs to restart to apply the imported settings." = "Import qilingan sozlamalarni qo'llash uchun dastur qayta ishga tushishi kerak.";
"The application needs to restart to apply the language change." = "Til o'zgarishini qo'llash uchun ilova qayta ishga tushirilishi kerak.";
"Theme" = "Mavzuni";
"Theme:" = "Mavzu:";
"Then release:" = "Keyin qo'yib yuboring:";
"This permission is needed to focus windows after you release the shortcut" = "Ushbu ruxsatni yorliqni chiqargandan so'ng, derazalarda bo'lish uchun kerak";
"This permission is needed to show screenshots and titles of open windows" = "Ushbu ruxsatnomani ochiq derazalarning ekran rasmlari va unvonlarini ko'rsatish uchun kerak";
"This permission is needed to show thumbnails and preview of open windows" = "Ushbu ruxsat eskizlarni va ochiq oynalarning oldindan ko'rishini ko'rsatish uchun kerak";
"Thumbnails" = "Eskiz";
"Title" = "Sarlavha";
"Title truncation" = "Sarlavha kemasi";
"Titles" = "Unvon";
"Trackpad haptic feedback" = "Trekpad teginish orqali qayta aloqa";
"Trigger" = "Trigger";
"Trigger shortcut" = "Tragger yorliq";
"Unassign existing shortcut and continue" = "Mavjud yorliqni qisqartiring va davom eting";
"Updates policy" = "Siyosatni yangilash";
"Updates policy:" = "Yangilanish siyosati:";
"Use the app without this permission. Thumbnails won’t show." = "Ilovadan ushbu ruxsatsiz foydalaning. Eskizlar ko'rsatilmaydi.";
"Version" = "Versiya";
"Vertical Swipe with Four Fingers" = "To'rt barmoq bilan vertikal surish";
"Vertical Swipe with Three Fingers" = "Uch barmoq bilan vertikal surish";
"View existing discussions" = "Mavjud munozarani ko'rish";
"Vim keys" = "Vim tugmalari";
"Vim keys already assigned to other actions:\n%@" = "Boshqa harakatlar uchun tayinlangan Vim kalitlari: \\ n% @";
"Visibility" = "Ko'rinishi";
"Visible Spaces" = "Ko'rinadigan bo'sh joylar";
"When disabled, avoids the macOS purple screen-recording indicator, and avoids flickers when playing DRM video. Thumbnails will be less up-to-date." = "O'chirilganda, macOS'ning binafsha rangli ekran yozish indikatoridan qochadi va DRM videoni ijro etishda miltillashlarning oldini oladi. Eskizlar kamroq yangilanadi.";
"When fullscreen" = "To'liq ekranda";
"When no open window" = "Ochiq deraza yo'q bo'lganda";
"While open, press:" = "Ochiq bo'lganida, bosing:";
"Window app icon size:" = "Oyna ilova belgisi hajmi:";
"Window is fullscreen" = "Deraza to'liq ekran";
"Window is minimized" = "Oynani minimallashtiradi";
"Window is on every Space" = "Oyna har bir joyda";
"Window is on Space %d" = "Deraza kosmosda% d";
"Window max width in row:" = "Qatordagi oyna maksimal kengligi:";
"Window min width in row:" = "Qatordagi oyna minimal kengligi:";
"Window order:" = "Oynalar tartibi:";
"Window Title" = "Oyna nomi";
"Window title contains" = "Oyna sarlavhasi o'z ichiga oladi";
"Window title font size:" = "Oyna sarlavhasi shrift hajmi:";
"Window title truncation:" = "Oyna sarlavhasini qisqartirish:";
"Windows" = "Derazalar";
"You can’t undo this action." = "Siz ushbu harakatni bekor qila olmaysiz.";
"You didn’t write your email, thus can’t receive any response." = "Siz elektron pochtangizni yozmadingiz, shuning uchun hech qanday javob ololmaysiz.";
"You may need to disable some conflicting system gestures" = "Ba'zi ziddiyatli tizim ishoralarini o'chirib qo'yishingiz kerak bo'lishi mumkin";
